Tekla Open API Reference for Tekla Structures 2025
PreferredTextPlacingTypes Methods
The PreferredTextPlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacingType
 The object is placed using the along line placing.
BaseLinePlacingType
 The object is placed using the base line placing.
BaseLineWithArrowAtEndPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the end point.
BaseLineWithArrowAtStartPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the start point.
LeaderLinePlacingType
 The object is placed with a leader line.
PointPlacingType
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
PreferredTextPlacingTypes Class
Tekla.Structures.Drawing Namespace